v2206/solver_ADMFoam/cavityTest/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

# runParallel -s "reconstruct" redistributePar -reconstruct -latestTime

rm -r proc*

touch foam.foam

# runApplication foamToVTK

#------------------------------------------------------------------------------
